{
  "id": 1,
  "attributes": {
    "title": "People spend night on roofs and in trees after Ukraine dam breach",
    "body": [
      {
        "type": "paragraph",
        "children": [
          {
            "type": "text",
            "text": "localStorage was not designed for modern applications and does not support the structured clone algorithm. The title is not clickbait, the message is abrupt “Stop Using localStorage!” there is no ambiguity here and we are not holding hands and singing kumbay to soften the blow."
          }
        ]
      },
      {
        "type": "paragraph",
        "children": [
          {
            "type": "text",
            "text": "localStorage came onto the scene around 2009 as a 5MB string based storage. It was never designed to be the definitive way to store things in the browser."
          }
        ]
      },
      {
        "type": "paragraph",
        "children": [
          {
            "type": "text",
            "text": ""
          }
        ]
      },
      {
        "type": "paragraph",
        "children": [
          {
            "type": "text",
            "text": "Let’s cut to the chase with some bullet points since our attention spans are in disarray these days:"
          }
        ]
      },
      {
        "type": "paragraph",
        "children": [
          {
            "type": "text",
            "text": ""
          }
        ]
      },
      {
        "type": "list",
        "format": "unordered",
        "children": [
          {
            "type": "list-item",
            "children": [
              {
                "type": "text",
                "text": "    One data type: You can only store strings. If you want to store anything else you have to serialize it to a string and deserialize to retrieve."
              }
            ]
          }
        ]
      },
      {
        "type": "list",
        "format": "unordered",
        "children": [
          {
            "type": "list-item",
            "children": [
              {
                "type": "text",
                "text": "    Historically slow: localStorage is somewhat slow at storing and retrieving data, which makes it undesirable for applications that require frequent transactions."
              }
            ]
          }
        ]
      },
      {
        "type": "list",
        "format": "unordered",
        "children": [
          {
            "type": "list-item",
            "children": [
              {
                "type": "text",
                "text": "    Limited storage: localStorage has a 5MB cap"
              }
            ]
          }
        ]
      },
      {
        "type": "list",
        "format": "unordered",
        "children": [
          {
            "type": "list-item",
            "children": [
              {
                "type": "text",
                "text": "    Serialization gotchas: If you are not familiar with the gotchas when storing data in localStorage you may be creating bugs in your application. These type-errors are not always obvious, especially for new developers."
              }
            ]
          }
        ]
      },
      {
        "type": "list",
        "format": "unordered",
        "children": [
          {
            "type": "list-item",
            "children": [
              {
                "type": "text",
                "text": "    Blocking operations: localStorage is not asynchronous and will block your application. It may even make your animations choppy in the right conditions. Asynchronicity is fundamental to creating fluid applications, especially for mobile devices"
              }
            ]
          }
        ]
      }
    ],
    "claps": 0,
    "views": 0,
    "readingTime": 600,
    "category": "World",
    "createdAt": "2024-01-22T19:05:40.314Z",
    "updatedAt": "2024-01-22T19:05:42.569Z",
    "publishedAt": "2024-01-22T19:05:42.551Z"
  }
}
